home/.emacs.d.own/init.el
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
 (package-refresh-contents))

(unless (package-installed-p 'use-package)
   (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(use-package general
  :config
  (general-create-definer jade/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  (jade/leader-keys
    "s" '(save-buffer :which-key "save buffer")
    "j" '(ace-jump-mode :which-key "ace jump mode")
    "." '(counsel-find-file :which-key "find file")
    "t"  '(:ignore t :which-key "toggles")
    "tt" '(counsel-load-theme :which-key "choose theme")
    "w"  '(:ignore w :which-key "window options")
    "wc" '(evil-window-delete :which-key "close window")
    "ww" '(evil-window-next :which-key "next window")
    "h"  '(:ignore h :which-key "help options")
    "hv"  '(counsel-describe-variable :which-key "variable help")
    "hf"  '(counsel-describe-function :which-key "function help")
    "hk"  '(helpful-key :which-key "key help")
    "o"  '(:ignore o :which-key "org mode options")
    "ol"  '(:ignore ol :which-key "LaTeX options")
    "olp" '(org-latex-export-to-pdf :which-key "export to PDF")
    "oll" '(org-latex-export-to-latex :which-key "export to LaTeX")
    "oh"  '(:ignore oh :which-key "HTML options")
    "ohh" '(org-html-export-to-html :which-key "export to HTML")
    "om"  '(:ignore oh :which-key "Markdown options")
    "omm" '(org-md-export-to-markdown :which-key "export to Markdown")
    "oo"  '(:ignore oo :which-key "OpenDocument options")
    "ooo" '(org-odt-export-to-odt :which-key "export to ODT")
    "ot"  '(:ignore ot :which-key "OpenDocument options")
    "ott" '(org-texinfo-export-to-texinfo :which-key "export to Texinfo")
    "b" '(:ignore b :which-key "buffer options")
    "bs" '(counsel-ibuffer :which-key "buffer search")
    "bn" '(next-buffer :which-key "buffer next")
    "bp" '(previous-buffer :which-key "buffer previous")
    "bk" '(kill-buffer :which-key "buffer kill")))

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(setq inhibit-startup-message t)

(scroll-bar-mode -1)    ;; Disable visible scrollbar
(tool-bar-mode -1)      ;; Disable the toolbar
(tooltip-mode -1)       ;; Disable tooltips
(set-fringe-mode 10)    ;; Give some breathing room
(menu-bar-mode -1)      ;; Disable the menu bar

(defun jade/set-font-faces ()
  (message "Setting faces!")
  (set-face-attribute 'default nil :font "Sauce Code Pro Nerd Font" :height 110)
  (set-face-attribute 'fixed-pitch nil :font "Sauce Code Pro Nerd Font" :height 110)
  (set-face-attribute 'variable-pitch nil :font "Cantarell" :height 110 :weight 'regular))

(if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
              (setq doom-modeline-icon t)
              (with-selected-frame frame
                (jade/set-font-faces))))
    (jade/set-font-faces))

(column-number-mode)
(global-display-line-numbers-mode t)
;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(use-package all-the-icons)
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 25)))

(use-package doom-themes
  :init (load-theme 'doom-one t))

(use-package diminish
:ensure t)

(use-package counsel
  :bind (("M-x" . counsel-M-x)
	 ("C-x b" . counsel-ibuffer)
	 ("C-x C-f" . counsel-find-file)
	 :map minibuffer-local-map
	 ("C-r" . 'counsel-minibuffer-history)))
  :config
  (counsel-mode 1)
  (setq ivy-initial-inputs-alist nil)

(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)	
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))

(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(use-package ivy-prescient
  :after counsel
  :config
  (ivy-prescient-mode 1))

(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1))

(use-package hydra)
(defhydra hydra-text-scale (:timeout 4)
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

(jade/leader-keys
  "ts" '(hydra-text-scale/body :which-key "scale text"))

(defun jade/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

(use-package org
  :hook (org-mode . jade/org-mode-setup)
  :config
  (setq org-ellipsis " ▾"
	org-hide-emphasis-markers t))

(org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp . t)
    (python . t)
    (shell . t)))

(setq org-confirm-babel-evaluate nil)

(push '("conf-unix" . conf-unix) org-src-lang-modes)

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

(dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))
