home/.emacs.d.own/Emacs.org
** Fix Fixed-Pitched Fonts 

#+begin_src emacs-lisp
;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
#+end_src

** Org Templates

#+begin_src emacs-lisp
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("ja" . "src java"))
(add-to-list 'org-structure-template-alist '("js" . "src js"))
#+end_src

** Org Mode Visual Fill

#+begin_src emacs-lisp
(defun jade/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . jade/org-mode-visual-fill))
#+end_src

** Auto-tangle Configuration Files

#+begin_src emacs-lisp
(defun jade/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/Emacs.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'jade/org-babel-tangle-config)))
#+end_src

* Development
** Languages
*** Languge Servers
**** lsp-mode
#+begin_src emacs-lisp
(defun jade/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . jade/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
  :config
  (lsp-enable-which-key-integration t))
#+end_src
**** lsp-ui
#+begin_src emacs-lisp
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))
#+end_src
*** TypeScript

#+begin_src emacs-lisp
(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 4))
#+end_src

Make sure to run this as well to install the language server and the language through npm.

#+begin_src shell
npm install -g typescript-language-server typescript
#+end_src

*** HTML 
**** Web Mode
 #+begin_src emacs-lisp
(use-package web-mode)
(add-hook 'html-mode-hook 'web-mode)
 #+end_src

#+begin_src shell
npm install -g vscode-html-languageserver-bin
#+end_src

**** Auto Rename Tag

#+begin_src emacs-lisp
(use-package auto-rename-tag)
(add-hook 'web-mode-hook 'auto-rename-tag-mode)
#+end_src

**** Impatient-Mode 

#+begin_src emacs-lisp
(use-package impatient-mode)
#+end_src

*** YAML

#+begin_src emacs-lisp
(use-package yaml-mode)
#+end_src

*** Fish

#+begin_src emacs-lisp
(use-package fish-mode)
#+end_src

*** Ini

#+begin_src emacs-lisp
(use-package ini-mode)
#+end_src

*** Haskell 

#+begin_src emacs-lisp
(use-package haskell-mode)
#+end_src

*** LaTeX
**** Preview Pane
#+begin_src emacs-lisp
(use-package latex-preview-pane)
(add-hook 'latex-mode-hook 'latex-preview-pane-mode)
#+end_src
**** PDF tools
#+begin_src emacs-lisp
(use-package pdf-tools)
#+end_src
** Company Mode 

#+begin_src emacs-lisp

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))
  
(use-package company-box
  :hook (company-mode . company-box-mode))

#+end_src

** Commenting

#+begin_src emacs-lisp
(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))
#+end_src

** Autopair
#+begin_src emacs-lisp
(use-package autopair)
(autopair-global-mode)
#+end_src
** Prettier 

#+begin_src emacs-lisp
(use-package prettier)
(add-hook 'after-init-hook #'global-prettier-mode)
#+end_src

Install prettier through npm
#+begin_src shell
npm i -g prettier
#+end_src

** Flycheck 
#+begin_src emacs-lisp
(use-package flycheck)
(add-hook 'lsp-mode 'flycheck-mode)
#+end_src
** Emmet 
*** Base Installation
#+begin_src emacs-lisp
(use-package emmet-mode)
#+end_src
*** Hooks
#+begin_src emacs-lisp
(add-hook 'css-mode-hook 'emmet-mode)
(add-hook 'web-mode-hook 'emmet-mode)
#+end_src
*** Variables 
#+begin_src emacs-lisp
(setq emmet-self-closing-tag-style " /")
#+end_src

** Yasnippets 
*** Base install
#+begin_src emacs-lisp
(use-package yasnippet
  :bind (("C-c e" . yas-expand) 
         ("C-c n" . yas-next-field)))
(add-hook 'prog-mode-hook #'yas-minor-mode)
(add-hook 'latex-mode-hook #'yas-minor-mode)
#+end_src
*** Snippets
#+begin_src emacs-lisp
(use-package yasnippet-snippets)
#+end_src
** Magit
#+begin_src emacs-lisp
(use-package magit)
  ;; Throws diff in the same window
  ;:custom
  ;(magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
  
(jade/leader-keys
  "g"   '(:ignore t :which-key "git")
  "gs"  'magit-status
  "gd"  'magit-diff-unstaged
  "gc"  'magit-branch-or-checkout
  "gl"   '(:ignore t :which-key "log")
  "glc" 'magit-log-current
  "glf" 'magit-log-buffer-file
  "gb"  'magit-branch
  "gP"  'magit-push-current
  "gp"  'magit-pull-branch
  "gf"  'magit-fetch
  "gF"  'magit-fetch-all
  "gr"  'magit-rebase)
#+end_src
** Git Gutter 
*** Base Install
#+begin_src emacs-lisp
(use-package git-gutter)
#+end_src
*** Global mode
#+begin_src emacs-lisp
(global-git-gutter-mode t)
#+end_src
*** Update interval
#+begin_src emacs-lisp
(custom-set-variables
 '(git-gutter:update-interval 1))
#+end_src
*** Sign Colors
#+begin_src emacs-lisp
(set-face-background 'git-gutter:modified "purple")
(set-face-foreground 'git-gutter:added "green")
(set-face-foreground 'git-gutter:deleted "red")
#+end_src
*** Sign Symbols
#+begin_src emacs-lisp
(custom-set-variables
 '(git-gutter:modified-sign "~~") 
 '(git-gutter:added-sign "++")   
 '(git-gutter:deleted-sign "--"))
#+end_src
** Projectile

#+begin_src emacs-lisp

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/.local/repos")
    (setq projectile-project-search-path '("~/.local/repos")))
  (setq projectile-switch-project-action #'projectile-dired))

#+end_src

*** Counsel Projectile

#+begin_src emacs-lisp
(use-package counsel-projectile
  :config (counsel-projectile-mode))
#+end_src

** Rainbow Delimiters

#+begin_src emacs-lisp

(use-package rainbow-delimiters)
(add-hook 'prog-mode-hook 'rainbow-delimiters) 
(add-hook 'org-mode-hook 'rainbow-delimiters) 

#+end_src

* Terminals
** term-mode

#+begin_src emacs-lisp
(use-package term
  :config
  (setq explicit-shell-file-name "bash") 
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))
(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))
#+end_src

** eshell

#+begin_src emacs-lisp
(defun jade/configure-eshell ()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Bind some useful keys for evil-mode
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

  (setq eshell-history-size         10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

(use-package eshell-git-prompt)

(use-package eshell
  :hook (eshell-first-time-mode . jade/configure-eshell)
  :config
  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t)
    (setq eshell-visual-commands '("htop" "zsh" "vim")))
  (eshell-git-prompt-use-theme 'powerline))
#+end_src

* File Management
** Dired
*** Basic Configuration

#+begin_src emacs-lisp
(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom ((dired-listing-switches "-Alh1vD --group-directories-first"))
  :config
  (dired-async-mode 1)
  (setq wdired-create-parent-directories t)
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "l" 'dired-single-buffer))
#+end_src

