home/.emacs.d.own/Emacs.org
*** Diredfl

#+begin_src emacs-lisp
(use-package diredfl)
(diredfl-global-mode)
#+end_src

*** Dired Single

#+begin_src emacs-lisp
(use-package dired-single)
#+end_src

*** Dired Icons

#+begin_src emacs-lisp
(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))
#+end_src
 
*** Dired Open

#+begin_src emacs-lisp
(use-package dired-open
  :config
  (setq dired-open-extensions '(("png" . "feh")
                                ("jpeg" . "feh")
                                ("jpg" . "feh")
                                ("pdf" . "zathura")
                                ("mp4" . "mpv")
                                ("mp3" . "mpv")
                                ("mkv" . "mpv"))))
#+end_src

*** Dired Hide Dotfiles

#+begin_src emacs-lisp
(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))
#+end_src

* Miscellaneous 
** Restart Emacs

#+begin_src emacs-lisp
(use-package restart-emacs)
#+end_src>

** Auto Package Update 

#+begin_src emacs-lisp
(use-package auto-package-update
  :config
  (setq auto-package-update-delete-old-versions t)
  (setq auto-package-update-hide-results t)
  (auto-package-update-maybe))
#+end_src>

** Ace Jump Mode 

#+begin_src emacs-lisp
(use-package ace-jump-mode)
#+end_src>

** Undo Tree 

#+begin_src emacs-lisp
(use-package undo-tree)
(global-undo-tree-mode)
#+end_src>


 
