home/.emacs.d.own/init.el

(use-package diredfl)
(diredfl-global-mode)

(use-package dired-single)

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package dired-open
  :config
  (setq dired-open-extensions '(("png" . "feh")
                                ("jpeg" . "feh")
                                ("jpg" . "feh")
                                ("pdf" . "zathura")
                                ("mp4" . "mpv")
                                ("mp3" . "mpv")
                                ("mkv" . "mpv"))))

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))
